export interface RegionData {
  [city: string]: {
    [district: string]: string[];
  };
}

export const locationData: RegionData = {
  '서울특별시': {
    '강남구': ['역삼동', '개포동', '청담동', '삼성동', '대치동'],
    '서초구': ['서초동', '반포동', '방배동', '양재동'],
    '송파구': ['잠실동', '신천동', '풍납동', '송파동'],
  },
  '경기도': {
    '성남시 분당구': ['분당동', '수내동', '정자동', '서현동', '이매동'],
    '수원시 영통구': ['매탄동', '영통동', '원천동', '광교동'],
    '용인시 수지구': ['풍덕천동', '죽전동', '동천동', '상현동'],
  },
  '인천광역시': {
    '연수구': ['송도동', '연수동', '동춘동'],
    '부평구': ['부평동', '산곡동', '청천동'],
  },
  '부산광역시': {
    '해운대구': ['우동', '중동', '좌동', '반여동'],
    '수영구': ['남천동', '수영동', '망미동'],
  }
};
